{"last_node_id":23,"last_link_id":23,"nodes":[{"id":8,"type":"easy imageSize","pos":[1645,1105],"size":[210,100],"flags":{},"order":6,"mode":0,"inputs":[{"name":"image","type":"IMAGE","link":5,"label":"图像"}],"outputs":[{"name":"width_int","type":"INT","links":null,"shape":3,"label":"宽度"},{"name":"height_int","type":"INT","links":null,"shape":3,"label":"高度"}],"properties":{"Node name for S&R":"easy imageSize"},"widgets_values":["Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920Width: 1440 , Height: 1920"]},{"id":15,"type":"JoinStrings","pos":[2463,491],"size":[315,106],"flags":{},"order":9,"mode":0,"inputs":[{"name":"string1","type":"STRING","link":13,"widget":{"name":"string1"},"label":"字符串1"},{"name":"string2","type":"STRING","link":14,"widget":{"name":"string2"},"label":"字符串2"}],"outputs":[{"name":"STRING","type":"STRING","links":[16],"slot_index":0,"shape":3,"label":"字符串"}],"properties":{"Node name for S&R":"JoinStrings"},"widgets_values":["","",", "]},{"id":11,"type":"ShowText|pysssss","pos":[2020,630],"size":[340,6726],"flags":{},"order":8,"mode":0,"inputs":[{"name":"text","type":"STRING","link":21,"widget":{"name":"text"},"label":"文本"}],"outputs":[{"name":"STRING","type":"STRING","links":[14],"slot_index":0,"shape":6,"label":"字符串"}],"properties":{"Node name for S&R":"ShowText|pysssss"},"widgets_values":["","The image is a high-resolution photograph likely taken with a DSLR camera, using natural lighting. It features a young woman with long brown hair, standing in a minimalist, white-walled room with wooden flooring. She is dressed in a white and blue striped crop top and matching high-waisted skirt, which highlights her slender physique. She holds a smartphone with a purple case, obscuring her face. The composition uses the rule of thirds, with her positioned off-center to the right. The background includes a white stool and a partially visible door.","This is a high-resolution photograph of a young woman sitting on a stool in a minimalist room. She is taking a selfie with a smartphone, obscuring her face. She has long, straight, light brown hair and wears a black, short, pleated dress with a white, off-shoulder sweater. Her legs are adorned with black thigh-high stockings. The room features light wooden flooring, white curtains, and a patterned wallpaper. Lighting appears natural, likely from a window, creating soft shadows. The composition uses the rule of thirds, placing the subject off-center. The photo was likely taken with a DSLR camera.","A high-resolution photograph captures a young woman in a cosplay outfit, likely from anime or manga, standing in a bedroom. She has long, straight brown hair and wears a white blouse with a black bow tie, a short black pleated skirt, and black thigh-high stockings with garters. Her skin is light, and she has a slim figure. She holds a smartphone with a floral case in front of her face, partially obscuring it. The room has white walls, a wooden floor, and a white door in the background. The lighting appears to be natural, coming from a window out of frame.","This is a high-resolution photograph of a young woman taking a selfie in a mirror. She has long, straight brown hair, fair skin, and is wearing a white blouse with a black bow tie, a short black pleated skirt, and black thigh-high stockings with garters. The woman's face is obscured by her smartphone, which has a red and white case. A white daisy is attached to her garter. The background features white curtains and a grey, patterned wall. The lighting is natural, likely from a window, and the composition follows the rule of thirds.","A photograph shows a young woman with long, light brown hair, wearing a matching white and light blue, sleeveless crop top and skirt set. She is taking a mirror selfie with a purple smartphone. The setting is a bright, modern room with white walls and a wooden floor. The woman's figure is slender with medium-sized breasts. The image uses natural lighting and the photo was likely taken with a DSLR camera, possibly a Canon EOS 5D Mark IV, with settings around f/4, 1/125 sec, and ISO 400.","This is a high-resolution photograph of a young woman taking a mirror selfie in a bright, well-lit room. She has long, straight, light brown hair and is wearing a matching pastel blue and white cropped top and skirt set. Her skin is fair and smooth, and she has a slender, petite physique with small breasts. She holds a purple smartphone, covering her face. The room features wooden flooring and white, patterned wallpaper. The image likely uses natural lighting from a window, and the camera angle is straight-on, centered on the subject, adhering to the rule of thirds.","A young woman with long, straight, light brown hair takes a mirror selfie in a modern, well-lit room with wooden flooring and white walls. She wears a white and light blue off-shoulder crop top and matching high-waisted skirt. The outfit accentuates her slim figure. Her skin is fair, and she is holding a lavender phone. The photo is likely taken with a DSLR camera, using natural lighting, with a shallow depth of field (f/2.8, 1/60s, ISO 400). The composition follows the rule of thirds, focusing on her reflection.","A young woman with fair skin and long, light brown hair takes a selfie in a bright, well-lit room with natural light. She wears a white and light blue, off-shoulder, cropped sweater with matching high-waisted skirt. The photo, likely taken with a smartphone, uses a mirror reflection, emphasizing symmetry. The background includes a white door and patterned wallpaper.","This is a high-resolution photograph taken with a DSLR camera, likely a Canon EOS 5D Mark IV, using a wide aperture (f/2.8) for a shallow depth of field, and natural lighting from a window. The subject is a young, slim woman with fair skin and long, straight brown hair. She is standing in front of a white, ornate door, taking a selfie with an iPhone. She wears a revealing white lace lingerie dress with a plunging neckline, highlighting her medium-sized breasts and slender figure. She also has white thigh-high stockings. The room has light-colored wallpaper with a subtle pattern, and the floor is wooden. The composition uses the rule of thirds, with the woman positioned in the center.","This is a high-resolution photograph taken with a DSLR camera, likely using a wide aperture (f/2.8) for a shallow depth of field, and natural lighting. The image features a young Asian woman with long, straight brown hair, standing in front of a large window with white curtains. She is wearing a white lace mini-dress with thin straps, revealing her slender physique and small breasts. Her skin is fair and smooth. She is holding a blue smartphone in front of her face, obscuring it. She also wears white thigh-high stockings. The room has a wooden floor and a patterned wallpaper in the background.","This is a high-resolution photograph taken with a DSLR camera, likely a Canon EOS 5D Mark IV, using a wide aperture (f/2.8) for a shallow depth of field, and natural lighting from a window. The image features a young woman with fair skin and long, straight brown hair, wearing a white lace lingerie dress that accentuates her slender figure and small breasts. She is taking a mirror selfie with an iPhone, her face obscured by the phone. She is standing in a bright room with hardwood floors and white walls, with a window to her left. The composition uses the rule of thirds, focusing on her body.","A photograph of a young woman with long, light brown hair, wearing a white lace lingerie set, taking a selfie in a well-lit room with natural light. She is standing by a window with white curtains, holding a blue smartphone. The room has wooden floors and patterned wallpaper. The composition uses the rule of thirds, with the woman positioned in the center. Likely taken with a DSLR camera, settings around f/2.8, 1/200s, ISO 400.","A photograph of a young woman taking a mirror selfie in a bedroom. She has light skin, long straight brown hair, and wears a black crop top with spaghetti straps, a white lace cardigan, and a short pleated black skirt. She also has black thigh-high stockings with lace tops. Her phone, which has a blue case, covers part of her face. The room has white curtains and a wooden floor. The lighting is natural, coming from a window not visible in the frame. Likely taken with a smartphone.","The image is a high-resolution photograph taken with a DSLR camera, likely using a wide aperture (around f/2.8), moderate shutter speed, and low ISO. It captures a young woman with long, straight, ash-blonde hair, wearing a form-fitting, dark blue mini-dress adorned with red cherries and green leaves. She also has red garters attached to sheer thigh-high stockings. She is standing in a room with wooden floors and white walls, holding a smartphone in front of her face, obscuring her features. The lighting appears to be natural, likely from a window, creating a soft, even illumination. The composition uses a rule of thirds, focusing on her torso and upper thighs.","A high-resolution photograph features a young woman with fair skin and long brown hair, standing in a well-lit room with natural lighting. She is taking a selfie with a purple smartphone, obscuring her face. She wears a tight, dark mini-dress adorned with red cherry patterns and red thigh-high stockings. The background includes a white door and patterned wallpaper. The image composition follows the rule of thirds. Likely taken with a DSLR camera, settings approximate: f/2.8, 1/60s, ISO 400.","A photograph of a slender woman with fair skin and long, straight brown hair, wearing a tight, dark blue dress with red cherries and a plunging neckline, taking a mirror selfie in a modern, well-lit room. She wears red thigh-high stockings and holds a purple phone with a cat sticker. The background features white walls and a wooden floor. The image uses natural lighting, and the photo was likely taken with a DSLR camera.","This is a high-resolution photograph of a young woman with long brown hair, wearing a short, tight black dress with red cherry patterns and red thigh-high stockings. She is holding a smartphone in front of her face, obscuring it, and is standing in a well-lit room with wooden floors and white walls. The lighting appears to be natural, coming from the left side of the image. The photo was likely taken with a DSLR camera, using a medium aperture setting to keep the subject in sharp focus while slightly blurring the background. The composition follows the rule of thirds.","This is a high-resolution photograph taken with a DSLR camera, likely a Canon EOS 5D Mark IV, using a 50mm lens at f/1.8, 1/125s, ISO 100. The image features a young Asian woman with long, straight black hair, wearing a tight, white mini dress adorned with colorful, playful lip prints. She's holding a smartphone with a red case, covering her face. The setting is a modern, well-lit bedroom with a white door and wooden floor. The image uses natural lighting and follows the rule of thirds composition.","A photograph captures a young Asian woman with long, straight black hair, taking a mirror selfie. She wears a short, white, patterned dress with red straps and thigh-high white stockings. The room has light-colored walls and a wooden floor. The lighting is natural, likely from a window, and the composition follows the rule of thirds. The camera likely used is a smartphone.","This is a high-resolution photograph of a slender East Asian woman with long black hair, standing in a well-lit room with natural lighting. She is taking a mirror selfie with a smartphone, wearing a short, tight-fitting, white mini dress adorned with colorful cartoon characters, and white thigh-high stockings. The background includes a white door and a partially visible curtain. The photo likely uses a DSLR camera with settings around f/2.8 aperture, 1/60 shutter speed, and ISO 400. The composition uses symmetry and leading lines, emphasizing the subject's figure.","This is a high-resolution photograph featuring a slender Asian woman with long, straight black hair, wearing a short, white dress adorned with colorful cartoon prints. She stands in a well-lit bedroom with natural light streaming through a window, capturing her reflection in a full-length mirror. The background includes a white door and a grey-patterned wall. She holds a smartphone with a floral case, obscuring her face. The image uses the rule of thirds for composition.","The image is a high-resolution photograph taken with a smartphone camera, likely using a wide aperture for a shallow depth of field. The subject is a light-skinned woman with long, straight brown hair, wearing a tight, short, blue and black dragon-patterned dress that accentuates her curvy figure. She is standing in a well-lit room with white walls and a wooden floor. She holds a smartphone with a red case in front of her face, partially covering it. She wears white thigh-high stockings, adding contrast to the dark dress. The image employs the rule of thirds, with the woman positioned centrally.","This is a high-resolution photograph of an Asian woman with long, straight brown hair, wearing a tight, blue dragon-print dress that accentuates her curvy figure. She is standing in a well-lit room with white walls and wooden floors, holding a smartphone with a red case in front of her face, partially obscuring her features. The photo uses natural lighting, and the camera angle is straight-on, capturing her from the waist up. She is also wearing white thigh-high stockings. The image employs the rule of thirds, with the woman positioned off-center to the right.","A photograph captures a young woman with long, straight, light brown hair taking a selfie in a well-lit room with natural light streaming through large windows. She wears a tight, off-the-shoulder, red lace mini dress, accentuating her curvy figure and ample breasts. Her skin tone is fair, and she holds a blue smartphone with a white flower sticker covering her face. The background features a wooden floor and a white door. The composition uses the rule of thirds, focusing on her upper body. Likely taken with a DSLR camera, settings: f/2.8, 1/200s, ISO 400.","A photograph of a slim woman with long brown hair, wearing a tight, blue and black dragon-patterned dress, and white thigh-high stockings. She takes a selfie in a bright room with natural light, using a smartphone with a red case. The background features a white door and patterned wallpaper. Likely taken with a smartphone camera.","A photograph of a young woman with pale skin and long black hair, wearing a black, frilly gothic-style dress with lace details and a red rose accessory. She is taking a selfie in front of a large window, with natural light illuminating her. The background shows a neutral-colored room with wooden floors. The image uses a rule of thirds composition and likely a smartphone camera with a wide aperture for a shallow depth of field.","The image is a high-resolution photograph taken with a DSLR camera, likely a Canon EOS 5D Mark IV, using a wide aperture for a shallow depth of field. The subject is a young woman with pale skin and long black hair, wearing a revealing black lace dress with ruffles, and black thigh-high stockings. She holds a smartphone with a red and white case, obscuring her face. The background features a white wall, a wooden floor, and a large window with white curtains. The lighting appears natural, coming from the window. The composition uses leading lines and the rule of thirds.","A young Asian woman with long, black hair and pale skin sits on a wooden floor, taking a selfie with a smartphone in a mirror. She wears a black, ruffled, gothic dress, thigh-high stockings, and a small, black, spherical object between her legs. The room features white walls, a window with blue curtains, and a door. The lighting is natural, coming from the window. The photo likely uses a smartphone camera, capturing a candid, intimate moment.","A photograph captures a young, slim woman with pale skin and long, dark hair, standing in front of a window. She wears a black, frilly gothic dress with lace details, a corset-like bodice, and thigh-high fishnet stockings. Her left hand adjusts the dress, while her phone, adorned with a red heart case, covers her face. The room has a wooden floor and white walls. Likely taken with a DSLR camera, using natural light from the window, the image employs the rule of thirds for composition.","The image is a high-resolution photograph taken with a smartphone camera, likely using a wide aperture for a shallow depth of field. It shows a young woman with light skin, long wavy brown hair, and a slender physique. She is standing indoors near a large window, wearing a white short-sleeved shirt, a grey pleated skirt, a grey and black striped tie, and black thigh-high stockings. She holds a smartphone with a red and black case in her right hand, taking a mirror selfie. The room has a wooden floor, white walls, and a white door in the background. The lighting is natural, coming through the window.","This is a high-resolution photograph likely taken with a DSLR camera, using natural lighting. The image features a young woman with long, wavy brown hair and fair skin, standing in front of a large window. She is wearing a tight white blouse, revealing her ample breasts, and a short gray pleated skirt. She also wears black thigh-high stockings. The background includes a white door and a patterned wallpaper. The image is composed using the rule of thirds, with leading lines from the window and door guiding the viewer's eye. The overall lighting is bright and evenly distributed.","The image is a high-resolution photograph taken with a DSLR camera, likely using a wide aperture (around f/2.8) for a shallow depth of field. The subject is a young woman with fair skin and long, straight brown hair. She is wearing a white, off-the-shoulder mini dress adorned with red heart patterns, and white thigh-high stockings. She stands in a room with white walls and wooden floors, with a white door and curtain in the background. The lighting is natural, likely from a window not visible in the frame. The composition follows the rule of thirds, with the woman positioned centrally.","This is a high-resolution photograph of a young woman with fair skin, long brown hair, and a slender physique, standing in a well-lit room with natural lighting. She is wearing a white off-shoulder mini dress with red heart patterns, and white thigh-high stockings. The background features a white door and a light grey patterned wall. The image uses the rule of thirds composition style. The photo likely taken with a DSLR camera, settings: f/2.8 aperture, 1/60 shutter speed, ISO 400.","The image is a high-resolution photograph taken with a smartphone, likely a Samsung Galaxy series, using natural lighting. It shows a young woman with fair skin and long brown hair, taking a mirror selfie. She is wearing a short, off-the-shoulder white dress with red heart patterns, and white thigh-high stockings. Her reflection is captured in a full-length mirror, showing a modern, minimalist bedroom with wooden floors and light-colored walls. The composition uses symmetry, with the subject centered and the mirror providing a balanced reflection.","This is a high-resolution photograph of a young woman with long, light brown hair, taking a mirror selfie in a well-lit room. She is wearing an off-the-shoulder, red lace mini dress that accentuates her curvy figure and ample breasts. The background shows a white door and a window with beige curtains. The image is likely taken with a DSLR camera using natural lighting. The composition follows the rule of thirds, and the photo is symmetrical.","This is a high-resolution photograph of a young Asian woman taking a mirror selfie in a modern, well-lit bedroom. She has long, dark hair styled in a side ponytail and wears a tight, white blouse with a black tie, and a very short, shiny black skirt. The room has light gray wallpaper and a white door with a silver handle. The bed is covered in white bedding. The photo was likely taken with a DSLR camera using natural lighting. The composition follows the rule of thirds.","This is a high-resolution photograph likely taken with a DSLR camera, possibly using a 50mm lens, an aperture of f/2.8, a shutter speed of 1/125 sec, and an ISO of 400. The image features a slim, young Asian woman with long, straight black hair, standing in front of a large window. She is wearing a white blouse with the sleeves rolled up, a black tie, a tight black leather mini-skirt, sheer black pantyhose, and black high-heeled shoes. The room has a light-colored carpet and patterned wallpaper. The lighting is natural, coming from the window, creating a soft, even illumination. The composition follows the rule of thirds, with the woman positioned centrally.","This is a high-resolution photograph taken with a DSLR camera, likely using a wide aperture (around f/2.8) to create a shallow depth of field, with natural lighting from a nearby window. The image features a slim, light-skinned woman with long, straight black hair, standing in a modern room. She is dressed in a white button-up shirt, black tie, black high-waisted latex mini-skirt, sheer black tights, and black patent leather heels. A pink flower is pinned to her skirt. The room has a white door, light grey patterned wallpaper, and a fluffy white rug. The composition uses the rule of thirds, with the woman centered and the window creating a leading line.","A photograph of a slim Asian woman with long black hair, wearing a white blouse and a black tie, paired with a shiny black mini skirt. She's taking a selfie in a bright room with natural light coming from a window. The background features white walls and a door. The photo uses the rule of thirds composition style. Likely taken with a DSLR camera, possibly a Canon EOS 5D Mark IV, with an aperture of f/2.8, shutter speed of 1/125s, and ISO 400.","The photograph captures a slender Asian woman with long black hair, dressed in a white blouse and tight black PVC skirt, posing in a well-lit bedroom. She's holding a smartphone with a red case, obscuring her face. The room features a white door, patterned wallpaper, and a window with cream curtains. Likely taken with a DSLR camera, using natural lighting.","This is a high-resolution photograph taken with a DSLR camera, likely using a wide aperture for a shallow depth of field. The image features a young Asian woman with long black hair, sitting on a fluffy white rug. She is wearing a sleeveless, light blue dress with a dragon design on the chest. Her feet are bare, and her toes are pointed. She is holding a smartphone with a floral case, obscuring her face. The room has wooden flooring, a white door, and a patterned wallpaper. Natural light streams in, highlighting her smooth, fair skin. The composition uses the rule of thirds.","A high-resolution photograph captures an East Asian woman with fair skin and long, straight black hair, taking a selfie in a bedroom. She wears a light blue, sleeveless mini-dress with cutouts, revealing her midriff and legs. She holds a smartphone with a red, white, and blue case, partially obscuring her face. She has white thigh-high stockings. The room has a wooden floor, white walls, and a white door in the background. The lighting is natural, likely from a window out of frame. The composition uses symmetry with the subject centered.","A high-resolution photograph of a young woman with long, straight, light brown hair, wearing a black, sleeveless, tight dress with a red garter belt and black stockings. She is taking a selfie in a well-lit room with natural light from a window, using a smartphone with a blue case. The background features white walls and a patterned wallpaper. The composition uses the rule of thirds, focusing on her torso. Likely taken with a DSLR camera, settings around f/2.8, 1/125 sec, ISO 400.","This is a high-resolution photograph taken with a DSLR camera, likely using a wide aperture (around f/2.8) for a shallow depth of field, and natural lighting from a nearby window. The image features a slender, light-skinned woman with long, straight brown hair, standing in front of a window. She is wearing a tight, black, sleeveless dress that accentuates her curves, with a red garter belt and black stockings. The room has a modern, minimalistic design with light-colored walls and a wooden floor. The composition follows the rule of thirds, focusing on her torso and face, partially obscured by her smartphone.","The photograph shows a young woman with long, straight brown hair taking a mirror selfie in a well-lit room. She is wearing a black, form-fitting dress with a plunging neckline, red garter straps, and black thigh-high stockings. The woman's face is partially obscured by her phone, which has a blue case. The room features light-colored walls with a subtle pattern, a window with white curtains, and wooden flooring. The image composition uses the rule of thirds, focusing on the woman's body and dress. Likely taken with a DSLR camera, using natural light.","The image is a high-resolution photograph likely taken with a DSLR camera, featuring a young woman with long, straight, light brown hair. She is posing in a modern, well-lit room with large windows and wooden flooring. She is wearing a tight, off-shoulder, red lace mini dress that accentuates her curvy figure and ample breasts. Her skin is fair, and she has a slender, toned physique. She is holding a lavender smartphone, covering her face, and a white flower is placed near her thigh. The room has a white door in the background, and the lighting appears to be natural, coming from the windows. The composition uses the rule of thirds, focusing on her body and the dress.","A photograph of a young woman with long brown hair, wearing a red lace off-shoulder dress, taking a selfie in a well-lit room with natural light. The woman is standing in front of a window, holding a blue smartphone, and her reflection is visible in the mirror. The room has a wooden floor and a patterned wallpaper. The image is likely taken with a DSLR camera, using a wide aperture to create a shallow depth of field, focusing on the subject.","This is a high-resolution photograph taken with a DSLR camera, likely a Canon EOS 5D Mark IV, using an aperture of f/2.8, shutter speed of 1/125s, and ISO 400. The image features a young woman with fair skin and long, straight brown hair, standing in a well-lit room with natural light streaming through a large window. She is wearing a white button-up shirt, a short black pleated skirt, and red thigh-high stockings. Her shirt is unbuttoned, revealing a significant amount of cleavage. She is holding a smartphone with a purple case, obscuring her face. The background includes a white door and patterned wallpaper. The composition uses leading lines from the window and door to draw attention to the subject.","This photograph, likely taken with a DSLR camera, captures a young woman standing indoors near a large window, reflecting natural light. She has long, straight brown hair and is wearing a white blouse with a red plaid tie, a short black skirt, and thigh-high red stockings. Her skin tone is fair. The room has light-colored walls and wooden flooring. The image uses the rule of thirds for composition.","A high-quality photograph captures a young woman with long brown hair taking a mirror selfie in a well-lit room. She wears a white blouse with a red plaid tie, a short black skirt, and red thigh-high stockings. Her skin is fair, and she's standing in front of a large window with beige curtains. The room has wooden flooring and a white door. The photo likely uses a DSLR camera with a wide aperture and natural lighting.","This is a high-resolution photograph taken with a smartphone camera, likely an iPhone, given the visible home button on the front. The subject is a slim, young woman with long brown hair, posing in front of a window with white curtains. She wears a tight, glittery silver mini dress that accentuates her curves, black lace thigh-high stockings, and black garter belts. She stands in a well-lit room with natural light streaming in from the window. The image uses a central composition with a focus on the woman's body, employing leading lines created by her pose and the window frame.","A photograph of a young woman with long brown hair, wearing a shiny silver mini dress, black lace stockings, and a garter belt. She is taking a selfie in front of a large window with natural light, reflecting off her dress. The room has light wood flooring and beige wallpaper. The image composition uses the rule of thirds, with leading lines from the window frame. Likely taken with a DSLR camera, using natural lighting.","A photograph captures a young woman with long, straight, light brown hair, standing in a well-lit room. She's wearing a shiny, silver mini dress that accentuates her curvy figure, and black thigh-high stockings with lace tops. Her skin is fair, and she's holding a smartphone with a blue case, partially obscuring her face. The room has white walls, a wooden floor, and a large window with white curtains. The photo likely uses a DSLR camera, with settings around f/2.8, 1/125s, and ISO 400, utilizing natural lighting. The composition follows the rule of thirds.","This is a high-resolution photograph likely taken with a DSLR camera, using natural lighting from a large window. The subject is a young woman with long brown hair and fair skin, taking a selfie. She is wearing a grey blouse, a black corset, a white pleated skirt, and black thigh-high stockings. Her physique is slender with medium-sized breasts. The background features a white door, grey wallpaper, and a window with white curtains. The image uses the rule of thirds composition style.","This is a high-resolution photograph taken with a DSLR camera, likely using a wide aperture (around f/2.8), moderate shutter speed, and low ISO. The image shows a young woman with long, straight brown hair, wearing a black, lace-trimmed mini dress with white floral accents. She is standing in a room with white walls and a wooden floor, with natural lighting coming from a window. She holds a smartphone with a purple case, covering her face. The composition uses symmetry, with the woman centered in the frame.","A high-resolution photograph captures a young woman with long, straight brown hair taking a mirror selfie. She wears a black, lace-trimmed mini dress with thigh-high stockings and a white garter on her left thigh. The room has light grey patterned wallpaper and wooden flooring. The woman, of East Asian descent, is likely using a smartphone with a purple case. The lighting is soft and natural, likely from a window, creating a flattering, even illumination. The composition follows the rule of thirds, with the woman positioned centrally. The photograph appears to be taken with a DSLR camera, using a moderate aperture (around f/5.6), a shutter speed of approximately 1/125 sec, and an ISO setting of 200.","A high-resolution photograph of a young woman with fair skin, long brown hair, and a slim figure, wearing a black lace-trimmed nightgown, black thigh-high stockings, and holding a small pink bow. She is taking a selfie in a bedroom with white curtains and a wooden floor. The image uses natural lighting, likely from a window, and has a symmetrical composition. The photo was likely taken with a DSLR camera, using a low aperture and moderate ISO.","The image is a high-resolution photograph taken with a smartphone camera, likely an iPhone, using natural lighting. It features a young woman with long, straight brown hair, wearing a light blue blouse, a striped tie, and a short white pleated skirt. She also wears thigh-high white stockings with floral patterns. The woman is posing in front of a white curtain and a gray patterned wall, with a wooden floor visible. Her reflection is captured in a mirror, with the camera angle slightly above eye level. The composition uses symmetry with leading lines from the curtain and mirror frame.","This is a high-resolution photograph taken with a smartphone, likely a Samsung Galaxy S21, using natural light. It features a young woman with long, straight, light brown hair, taking a selfie in a mirror. She is wearing a light blue, buttoned-up crop top that reveals her midriff and a short, white pleated skirt. Her legs are adorned with white thigh-high stockings featuring lace patterns. She holds a smartphone with a blue case, obscuring her face. The background includes a white door and a patterned wall. The image uses the rule of thirds for composition.","A high-resolution photograph captures a woman with long brown hair, wearing a blue blouse with a ruffled front, a striped tie, and a short white pleated skirt. She holds a smartphone, obscuring her face. She wears white lace thigh-high stockings. The setting is a room with wooden flooring and white curtains, with soft natural lighting. Likely taken with a DSLR camera, using a shallow depth of field. The composition follows the rule of thirds.","A young Asian woman with long brown hair sits on a wooden floor, taking a selfie with a purple phone. She wears a light blue and white striped crop top and matching shorts, with a white cardigan draped over her shoulders. She has a slender build and is barefoot, wearing fluffy slippers. The background includes white curtains and a door. The image is well-lit with natural light, likely taken with a smartphone camera.","This is a high-resolution photograph likely taken with a DSLR camera, using natural light. The image features a young Asian woman with long, straight black hair, taking a mirror selfie. She is wearing a black off-the-shoulder crop top, a pleated gray mini skirt, and sheer black tights. Her skin is fair, and she has a slender build. The background shows a modern, bright room with a large window, and light-colored wallpaper. The composition follows the rule of thirds, with the subject positioned centrally.","This is a high-resolution photograph taken with a DSLR camera, likely using a wide aperture (f/2.8), fast shutter speed (1/250s), and low ISO (100). It features a young Asian woman with long, straight black hair, posing in front of a window with natural light. She wears a black off-the-shoulder crop top, a grey pleated mini skirt, and sheer black tights. She holds a red and white polka-dotted phone. The room has a wooden floor and white walls. The composition uses the rule of thirds, focusing on the subject.","This is a high-resolution photograph of an East Asian woman with long black hair and bangs, taking a selfie in a well-lit room with natural light. She is wearing a black, off-shoulder crop top, a short grey pleated skirt, and sheer black tights. She stands in front of a window with white curtains, holding a smartphone with a red case. The background features a white door and a patterned wallpaper. The image uses a rule of thirds composition style. Likely taken with a DSLR camera, possibly a Canon EOS 5D Mark IV, with an aperture of f/2.8, shutter speed of 1/125s, and ISO 200.","A high-resolution photograph of a young East Asian woman with long black hair, taking a selfie in a well-lit room. She wears a black off-shoulder crop top and a short grey pleated skirt, accentuating her slim figure and small breasts. She holds a smartphone with a red case, obscuring her face. The background features a white door, patterned wallpaper, and a window with white curtains. The composition uses the rule of thirds, with natural lighting enhancing the scene. Likely shot with a DSLR camera, using a low aperture and moderate ISO.","A photograph of an East Asian woman with long brown hair, wearing a tight, strapless pink mini-dress and white thigh-high stockings, taking a selfie in a modern, well-lit room with hardwood floors and patterned wallpaper. The image uses natural lighting from a window on the left, and the composition follows the rule of thirds. Likely taken with a smartphone camera.","This is a high-resolution photograph of a young woman taking a selfie in a well-lit room with natural light. She has long, straight brown hair and is wearing a tight, pale pink dress that accentuates her curvy figure. Her breasts are large, and she has a fair skin tone. She is holding a smartphone with a red and white case, partially obscuring her face. The background features a white door, a window with sheer curtains, and a patterned wall. The image uses the rule of thirds composition style. The lighting is soft and natural.","The image is a high-resolution photograph likely taken with a DSLR camera, possibly using a wide aperture for a shallow depth of field, and natural lighting. It features a young, slender Asian woman with long brown hair, wearing a tight, pink, off-shoulder mini dress that accentuates her curves. She stands in front of a window, taking a mirror selfie with a phone adorned with a red and white polka dot case. She is also wearing white thigh-high stockings. The room has light wooden floors and white walls with subtle patterns, and the composition follows the rule of thirds, with her body positioned centrally.","This is a high-resolution photograph of a young woman with long, light brown hair, standing in a well-lit room with natural light streaming through large windows. She is taking a mirror selfie with a smartphone featuring a Minnie Mouse case. She wears a tight, off-the-shoulder, pastel pink mini dress that accentuates her curvy figure and ample breasts. She has fair skin and is wearing white thigh-high stockings. The room has a wooden floor and white walls with a door in the background. The photo is likely taken with a DSLR camera, possibly a Canon EOS 5D Mark IV, using a wide aperture for a shallow depth of field, moderate ISO, and a fast shutter speed.","The image is a high-resolution photograph taken with a DSLR camera, likely a Canon EOS 5D Mark IV, using a wide aperture (f/2.8), fast shutter speed (1/125 sec), and low ISO (100). It features a slender, young Asian woman with long, straight, light brown hair and fair skin. She stands indoors by a window, taking a selfie with a smartphone, partially covering her face. She wears a white, oversized button-down shirt with a black tie, revealing her slender physique and small breasts. The room has light wooden flooring and cream-colored walls with a subtle pattern. The lighting is natural, coming from the window, casting soft shadows. The composition uses the rule of thirds, with the woman positioned off-center, creating a balanced and engaging image.","A photograph of a slender, fair-skinned woman with long brown hair, wearing a form-fitting, sleeveless navy blue dress with large pink rose patterns. She holds a phone with a red polka-dot case, covering her face. The room has white curtains, light wood flooring, and a patterned wall. The image is taken with a smartphone camera, likely using natural light.","This is a high-resolution photograph likely taken with a DSLR camera, featuring a young woman with light skin and long brown hair, wearing a white blouse and black tie, standing in front of a window with white curtains. The room has a wooden floor and a patterned wallpaper. The lighting is natural, coming from the window. The composition follows the rule of thirds.","A photograph of a slim, light-skinned woman with long brown hair, wearing a white, tight-fitting, short-sleeved dress and a black tie. She stands in front of a window, holding a smartphone, obscuring her face. The room has light wood flooring and patterned wallpaper. The image, likely taken with a DSLR camera, uses natural lighting, and follows the rule of thirds.","This is a high-resolution photograph taken with a smartphone camera, likely an iPhone, capturing a young woman in a white, long-sleeved, A-line dress with a black necktie. She has long, straight, light brown hair, and her face is obscured by the phone she uses to take the selfie. The room is well-lit with natural light coming from large windows on the left. The woman stands in the center of the frame, adhering to the rule of thirds, with the wooden floor and patterned wallpaper visible in the background.","A young Asian woman with long black hair takes a mirror selfie in a well-lit room with natural light. She wears a white blouse with a pink bow, a short pink plaid skirt, and white thigh-high stockings. Her skin is smooth and pale, and she has a slim figure. The room has a wooden floor and a white door. The photo is likely taken with a smartphone camera, using the rule of thirds for composition.","This is a high-resolution photograph of a young woman taking a selfie in a modern, well-lit room with wooden flooring and white walls. She has long, straight black hair and wears a white short-sleeved blouse with a pink bow, a pink plaid mini skirt, and white thigh-high stockings. She holds a red and white polka-dotted phone case, covering her face. The image uses natural light from a window, likely taken with a DSLR camera, using a medium aperture (around f/5.6) and a moderate ISO (around 400). The composition follows the rule of thirds.","A high-resolution photograph captures a young Asian woman with long, black hair, standing in front of a window. She's wearing a white blouse, pink plaid skirt, white thigh-high stockings, and a red bow. Her breasts are prominent, and she's holding a smartphone with a red and white case. The room has wooden floors and a cream-colored curtain. Likely taken with a DSLR camera using natural light.","A high-resolution photograph captures a young East Asian woman with long, straight black hair, standing in front of a large window in a well-lit room with wooden flooring. She is wearing a white short-sleeved blouse with a pink bow at the collar, a pink plaid skirt, and white thigh-high stockings. The background features white curtains and a patterned wallpaper. The image is likely taken with a DSLR camera using natural lighting.","A photograph of a young woman taking a mirror selfie in a well-lit room with natural lighting. She has long, straight brown hair, fair skin, and is wearing a short, white button-up blouse with a blue and red plaid tie, a matching short skirt, and white thigh-high stockings. The background includes a white door and a patterned wallpaper. The camera angle is straight-on, likely using a smartphone camera.","This is a high-resolution photograph of a young woman with long brown hair, wearing a revealing schoolgirl outfit. She stands in a well-lit room with large windows and patterned wallpaper, taking a mirror selfie with a smartphone. The outfit includes a white short-sleeve blouse, a short plaid skirt, and thigh-high white stockings. The lighting is natural, coming from the windows. The photo uses a wide aperture for a shallow depth of field, likely shot with a DSLR camera.","The image is a high-resolution photograph of a young woman with fair skin and long, straight brown hair, wearing a revealing schoolgirl outfit. She stands in front of a large window, taking a mirror selfie with a smartphone, which has a red heart sticker. The outfit includes a short, white blouse with a plaid tie, and a short, pleated plaid skirt. The room is brightly lit with natural light coming through the window. The walls are white with a subtle pattern, and there's a closed white door in the background. The photo uses a high shutter speed, likely around 1/125, with an aperture of f/2.8 and ISO 400, ensuring sharpness and detail. The composition follows the rule of thirds.","The photograph depicts a slender, light-skinned woman with long brown hair taking a selfie in a mirror. She wears a navy blue, form-fitting dress adorned with large pink and white flowers. The room has light-colored walls and wooden flooring. The image likely uses a smartphone camera with natural lighting. The woman's pose and the floral dress create a symmetrical composition.","A high-resolution photograph of a young Asian woman taking a selfie in a well-lit room. She wears a white, form-fitting blouse with a black tie, and a short, pleated black skirt. Her long, dark hair cascades over her shoulders. She's standing in front of a large window with white curtains, holding a smartphone with a red and white case. The room has wooden flooring and a white door. Likely shot with a DSLR camera using natural lighting.","A photograph of a young Asian woman taking a mirror selfie in a brightly lit room with wooden flooring and white walls. She is dressed in a white blouse and black pleated skirt, with thigh-high white stockings. Her long black hair is styled in pigtails, and she covers her face with a smartphone adorned with a red and white case. The image uses natural lighting and follows the rule of thirds.","A young Asian woman with long black hair takes a mirror selfie in a bright, modern room. She wears a tight white blouse and a short black pleated skirt, with white thigh-high stockings. Her breasts are prominent and her skin is pale. The room has a wooden floor, white walls, and a window with white curtains. The photo is likely taken with a smartphone, capturing a symmetrical composition with natural lighting.","A high-resolution photograph featuring a young Asian woman with long black hair, wearing a white blouse, black tie, and short black pleated skirt. She stands in front of a window, holding a phone with a red and white case, capturing her reflection. She wears white thigh-high stockings. The room has light wooden flooring and white walls. Likely taken with a DSLR camera, using natural lighting from the window.","This is a high-resolution photograph of a young woman taking a selfie in a well-lit room. She is of East Asian descent with long, straight, light brown hair and fair skin. She is wearing a gray, long-sleeve top with a high collar and a black corset that accentuates her slim waist and large breasts. Her skirt is white and pleated, ending above her knees, and she is wearing black thigh-high stockings with red garters. The woman holds a smartphone with a purple case, obscuring her face. The background features a large window with sheer curtains and a white door. The lighting is natural, likely from the window, and the photo is composed using the rule of thirds.","This is a high-resolution photograph taken with a smartphone camera, likely an iPhone, featuring a young Asian woman with long, straight, gray hair, taking a mirror selfie in a brightly lit room. She wears a tight, gray blouse with a plunging neckline, a black corset, a white pleated skirt, and black thigh-high stockings. The background shows a white door and a window with white curtains, allowing natural light to flood the room. The composition uses symmetry, with the woman centered in the frame.","A high-resolution photograph of a young Asian woman with long, straight black hair, taking a mirror selfie in a well-lit room with natural light streaming in from a large window. She wears a cropped grey top, white pleated mini-skirt, and white lace gloves, accentuating her slim figure and small breasts. The room features light-colored wallpaper and a wooden floor. The image employs the rule of thirds, with the woman positioned centrally. Likely taken with a smartphone camera.","A young woman with long black hair and a fair complexion takes a selfie in a well-lit bedroom. She wears a grey crop top with lace sleeves, a white pleated mini-skirt, and white thigh-high stockings. The room features a large window, patterned wallpaper, and a closed door. The photo is likely taken with a smartphone, using natural lighting.","A high-resolution photograph of a young woman with long, straight black hair, taking a selfie in a brightly lit room. She wears a grey crop top and a white pleated mini-skirt, paired with white lace gloves and thigh-high stockings. The background features a window with white curtains and a door. The image has a watermark of a stylized flower. Likely taken with a DSLR camera, using natural lighting.","A photograph captures a young woman with long black hair, wearing a grey crop top, white pleated skirt, and lace gloves, taking a selfie in a well-lit room with natural light. The image uses symmetry, with her standing in front of a window. Likely taken with a smartphone camera.","This is a high-resolution photograph likely taken with a DSLR camera, featuring a young woman with light skin and long brown hair, wearing a white crop top with colorful cartoon characters, a black pleated mini-skirt, and black thigh-high stockings. She has cat ears on her head and is holding a smartphone, partially covering her face. The setting is a modern, well-lit room with white curtains and gray patterned wallpaper. The composition uses leading lines from the curtain and rule of thirds. The lighting appears natural, possibly supplemented by indoor lights.","A photograph of a young woman with fair skin, long brown hair, and cat ears. She wears a white crop top with colorful cartoon characters, a black pleated skirt, and black thigh-high stockings with garters. She stands in a bright room with white walls and a wooden floor, holding a smartphone, obscuring her face. The image uses natural lighting, likely taken with a DSLR camera, using a wide aperture for a shallow depth of field. The composition follows the rule of thirds, with the woman positioned centrally.","A high-resolution photograph of a young woman with light skin, straight brown hair, and cat ears, taking a selfie in a bedroom. She wears a white crop top with colorful, cartoonish designs, a black pleated skirt, and black thigh-high stockings. The room has light-colored walls and wooden floors. The lighting appears natural, likely from a window. The image uses the rule of thirds composition style. The likely camera used is a smartphone.","A young woman with fair skin and long brown hair, wearing a white t-shirt with colorful cartoon characters, a black pleated skirt, and black thigh-high stockings with garters, poses in a well-lit bedroom. She has a slim figure, small breasts, and is holding a smartphone with a white cat ear headband. The room features wooden flooring and patterned wallpaper. The photo is likely taken with a DSLR camera, using natural lighting.","The image is a high-resolution photograph of a young Asian woman in a cosplay outfit, standing in a well-lit room with natural light streaming through large windows. She has long, black hair and is wearing a white sailor-style dress with blue accents, including a sailor collar, short sleeves, and a pleated skirt. Her outfit is accentuated by thigh-high white stockings. She holds a smartphone with a red and white polka dot case, covering her face. The room has a wooden floor and white walls with a patterned wallpaper. The photo likely uses a DSLR camera with a wide aperture (around f/2.8), a fast shutter speed (around 1/200), and a low ISO (around 100), creating a sharp and well-lit image. The composition follows the rule of thirds.","This is a high-resolution photograph featuring a young Asian woman with long, straight black hair, posing in a well-lit room with large windows. She wears a white, sailor-style outfit with blue accents and thigh-high white stockings, creating a cute and playful aesthetic. Her outfit has a nautical theme with a small emblem on the chest. She is taking a mirror selfie with a phone, which has a red and white case. The room has a wooden floor, a white door, and light-colored wallpaper. The photo likely uses natural lighting from the windows.","A high-resolution photograph of an Asian woman with long black hair, wearing a white sailor outfit with a blue neckerchief and a heart-shaped patch on her chest. She stands in a bright, sunlit room with wooden flooring and white walls, taking a mirror selfie with a red phone case. The image uses natural lighting, and the camera angle is slightly low, emphasizing her legs.","A high-resolution photograph captures a young Asian woman in a revealing sailor outfit, standing by a large window. She wears a white, short-sleeved dress with blue trim, a short skirt, and white thigh-high stockings. Her long black hair and pale skin contrast with the bright room. The room features a wooden floor and a door with a brass handle. The lighting is natural, streaming in through the window. The image is likely taken with a DSLR camera, using a shallow depth of field and a moderate aperture.","A young woman with long, straight black hair and a fair complexion takes a selfie in a well-lit room with natural light from a large window. She wears a white crop top, a short black pleated skirt, and white thigh-high stockings. The room has light-colored walls and a wooden floor. The photo is likely taken with a smartphone, using a wide-angle lens.","This is a high-resolution photograph of an Asian woman with long black hair, wearing a white crop top, black pleated skirt, and white thigh-high stockings. She is posing in front of a large window, with natural light streaming in, highlighting her slender figure. The background shows a wooden floor and patterned wallpaper. The photo was likely taken with a DSLR camera, using a medium aperture to keep the subject in sharp focus while slightly blurring the background. The composition uses the rule of thirds, with the subject centered.","A high-resolution photograph featuring an Asian woman with long, dark hair, wearing a white crop top and black pleated mini skirt, taking a selfie in a well-lit room with natural light from a large window. She's standing in front of a white door, holding a smartphone with a red and white case. The image uses the rule of thirds and has a slight upward angle. Likely taken with a DSLR camera, settings: f/4, 1/200s, ISO 200.","A young woman with long, straight black hair and fair skin takes a selfie in a well-lit bedroom. She is wearing a white crop top with black trim, a short black pleated skirt, and white thigh-high socks. Her phone has a red case with a heart design. The room has wooden floors, a large window, and patterned wallpaper. The photo was likely taken with a smartphone.","This is a high-resolution photograph likely taken with a DSLR camera, possibly a Canon EOS 5D Mark IV, using a 50mm lens, aperture f/2.8, shutter speed 1/200s, ISO 400. The image features a slim Asian woman with long, dark hair, wearing a tight, off-shoulder, purple dress that accentuates her curves. She is taking a selfie in a well-lit room with natural light from a window, using a phone with a red and white case. The background includes a white door and patterned wallpaper. The composition uses the rule of thirds, focusing on the subject.","The image is a high-resolution photograph of an Asian woman with long, straight black hair, wearing a tight, off-the-shoulder, mauve dress that accentuates her curves. She is taking a mirror selfie with a smartphone in a room with natural light streaming in from a window on the left. The room features white walls and a wooden floor. The woman's face is partially obscured by the phone. The image likely uses a DSLR camera with a wide aperture for a shallow depth of field, and a moderate ISO setting. The composition follows the rule of thirds.","This is a high-resolution photograph likely taken with a DSLR camera, using natural lighting from a window. The image features a slim Asian woman with long, straight black hair, wearing a tight, off-shoulder, purple mini dress. She is standing in front of a window, with one hand holding a smartphone, obscuring her face. The room has light-colored walls and a wooden floor. The composition uses leading lines from the window frame and rule of thirds for balance.","This is a high-resolution photograph of a young woman taking a mirror selfie in a brightly lit room with natural light streaming through a window. She is standing in front of a mirror, capturing her reflection with an iPhone. She has long, straight black hair and is wearing a tight, pink and white mini dress with \"Happy\" printed across it. She also wears white thigh-high stockings. The room has light-colored walls with a subtle pattern and wooden flooring. The composition follows the rule of thirds, with the woman's reflection centered in the frame. The lighting is bright and even, likely using natural light.","This is a high-resolution photograph of a young woman taking a mirror selfie in a well-lit room. She is wearing a tight, white mini-dress with pink lettering that reads \"ANGEL,\" accentuating her slim figure. Her long, straight black hair flows over her shoulders. She is also wearing white thigh-high stockings with pink bows. The woman's face is obscured by a phone with a red and white polka-dotted case. The room features a large window with sheer curtains, allowing natural light to flood in. The walls are adorned with a patterned wallpaper. The image employs a rule of thirds composition style.","A high-resolution photograph of an attractive young woman with long, black hair, wearing a tight, pink and white mini-dress with \"Happy\" text. She holds a smartphone with a red case, obscuring her face. She has fair skin and wears white thigh-high stockings. The room has a wooden floor, a large window with white curtains, and a patterned wallpaper. Likely taken with a DSLR camera, natural lighting.","This is a high-resolution photograph of a young woman with long brown hair, taking a selfie in a well-lit, modern room with wooden flooring. She wears a white blouse, black pleated skirt, and a red plaid tie, with black thigh-high stockings. She points with her right hand. The photo is likely taken with a DSLR camera, using natural light from a window. The composition uses the rule of thirds.","The image is a high-resolution photograph, likely taken with a DSLR camera, using natural light from a window. It features a young woman with long, wavy brown hair, taking a selfie in a mirror. She wears a white button-up shirt, a red and green plaid tie, a short black pleated skirt, and thigh-high black stockings with garters. The background shows a white door and a patterned wallpaper. The composition uses the rule of thirds.","A photograph captures a young woman taking a mirror selfie in a modern, well-lit room with wooden floors and white walls. She has long, straight, light brown hair and is wearing a black crop top, a black ruffled skirt, and black lace-top stockings. Her skin tone is fair. She uses a lavender phone case. The composition uses symmetry with a leading line from the mirror edge. Likely taken with a smartphone camera, considering the natural lighting and lack of visible camera settings.","A young woman, likely in her early twenties, takes a selfie in a well-lit room. She has long, straight brown hair and is wearing a white button-up shirt, a red plaid tie, and a short black pleated skirt. Black thigh-high stockings with garters are visible. She holds a smartphone with a purple case, covering her face. The room has a white door and a window with white curtains. The photo is taken with a DSLR camera, likely with a wide aperture (f/2.8), fast shutter speed (1/200), and low ISO (100). The composition uses leading lines from the window and door.","A photograph of a young woman in a revealing schoolgirl outfit, standing in front of a window with natural light. She has long, straight brown hair and fair skin. She wears a white button-up shirt, a striped tie, and a short black skirt, paired with black thigh-high stockings. The image is taken with a smartphone, likely using a wide aperture to create a shallow depth of field. The composition follows the rule of thirds, with the woman centered and the window adding leading lines. The background includes a patterned wall and wooden floor.","This is a high-resolution photograph of a young Asian woman taking a mirror selfie in a well-lit, modern room with natural light streaming through large windows. She has long, straight black hair, fair skin, and is wearing a white blouse, black pleated mini skirt, and a black tie, paired with white thigh-high stockings. The image uses the rule of thirds, with her positioned slightly off-center, creating a balanced composition. The woman is holding a smartphone with a red case featuring a cartoon character. The wooden floor and white curtains add to the room's elegant ambiance. Likely taken with a DSLR camera, possibly a Canon EOS 5D Mark IV, with settings around f/2.8, 1/125 sec, ISO 200.","This is a high-resolution photograph of a young Asian woman with long black hair, standing in a well-lit room with large windows. She is dressed in a white blouse with a black pleated skirt, and white thigh-high stockings. The image is likely taken with a DSLR camera, using natural light, with a focus on symmetry and leading lines.","A high-resolution photograph captures a young woman with long, straight black hair, wearing a white blouse, black pleated skirt, and a black tie, standing in a well-lit room. She's taking a selfie with a red iPhone, partially obscuring her face. She's wearing white thigh-high stockings. The room has white walls and a wooden floor. The photo likely uses a DSLR camera with a shallow depth of field, natural lighting, and adheres to the rule of thirds.","A high-resolution photograph of a young Asian woman with long black hair, wearing a white blouse, black pleated skirt, and black tie, taking a selfie in a well-lit room with natural light from a large window. She wears thigh-high white stockings. The room has a wooden floor and patterned wallpaper. Likely taken with a DSLR camera, using a wide aperture for a shallow depth of field, and a fast shutter speed to capture the image clearly. The composition uses the rule of thirds.","A young woman with long, straight brown hair and light skin takes a mirror selfie in a bright room. She wears a white crop top with a cut-out shoulder and a pleated white mini-skirt, paired with white lace thigh-high stockings. The room has light wood flooring and white walls with subtle patterns. She holds a purple phone, partially obscuring her face. The photo is likely taken with a smartphone, using natural lighting.","A young woman with long brown hair takes a selfie in a mirror. She wears a white, textured crop top and a pleated white mini skirt, complemented by white thigh-high stockings. The room features light grey wallpaper and wooden flooring. The lighting appears natural, likely from a window. The photo is taken with a smartphone, using a front-facing camera.","This is a high-resolution photograph of a young woman taking a mirror selfie in a modern, well-lit bedroom. She has long, straight brown hair, fair skin, and is wearing a white, off-shoulder sweater, a white pleated mini-skirt, and white lace thigh-high stockings. She holds a purple smartphone in her right hand, flashing a peace sign with her left hand. The room has wooden floors, white curtains, and a patterned wallpaper. The image likely uses natural lighting from a window, and the photo is taken with a DSLR camera, possibly a Canon EOS 5D Mark IV, with settings around f/2.8, 1/60 sec, and ISO 400. The composition follows the rule of thirds.","This photograph, likely taken with a smartphone camera, captures a young woman with long brown hair, fair skin, and an attractive, slender physique. She's wearing a white lace crop top, a white pleated mini skirt, white thigh-high lace stockings, and a white fuzzy cardigan. She's holding a lavender phone, partially obscuring her face. The setting is a modern, well-lit room with wooden flooring and white walls. The composition uses the rule of thirds, with the subject centered.","This is a high-resolution photograph taken with a smartphone, likely an iPhone, capturing a young woman standing in a room with white walls and a wooden floor. The woman, with light brown hair, is wearing a black crop top, a white knitted cardigan, and a black pleated skirt. She also has black lace thigh-high stockings. She is holding a blue smartphone in front of her face, partially obscuring it. The lighting is natural, likely from a window out of frame, providing even illumination. The image follows the rule of thirds, with the woman positioned centrally.","A high-resolution photograph captures a young woman with long, straight black hair, standing in front of a window, taking a mirror selfie. She wears a white blouse, black high-waisted shorts, and white thigh-high stockings. The room has light wooden flooring and beige wallpaper. The natural lighting enhances her fair skin. The photo is likely taken with a DSLR camera, using an aperture of f/2.8, shutter speed of 1/125 sec, and ISO 200. The composition uses leading lines from the window and mirror.","This is a high-resolution photograph taken with a DSLR camera, likely using a wide aperture (around f/2.8) for a shallow depth of field, moderate ISO (400), and a shutter speed of about 1/125s. The image shows a young Asian woman with long, straight black hair, wearing a white blouse, black high-waisted shorts, and white thigh-high stockings. She is posing in front of a large window, with her phone covering her face, revealing a playful and cute expression. The room has a modern interior with light-colored walls and a wooden floor. The lighting is natural, coming from the window, creating soft shadows. The composition uses leading lines from the window and the door, drawing attention to the subject.","A high-resolution photograph captures a young Asian woman with long black hair, wearing a white blouse and a short black skirt. She stands in a well-lit room with a large window to the left, using a phone with a red case to take the selfie. The room has wooden flooring and a white door. The composition uses the rule of thirds, emphasizing her figure. The lighting is natural, likely from the window. The photo appears to be taken with a smartphone camera.","A high-resolution photograph of an East Asian woman with long, straight black hair, wearing a white blouse and a black, high-waisted skirt, with suspenders. She is taking a selfie in a well-lit room with natural light coming through a window on the left. She holds her hair with one hand and her phone with the other. The background includes a white door and a patterned wallpaper. The image uses the rule of thirds, focusing on her face and upper body. The likely camera used is a DSLR with an aperture of f/2.8, shutter speed of 1/125s, and ISO 200.","A high-resolution photograph of a slim, fair-skinned woman with long brown hair, wearing a pastel-striped, sleeveless dress that accentuates her curves. She stands in front of a window with a patterned curtain, taking a selfie with an iPhone. The room has wooden floors and light-colored walls. Likely taken with a DSLR camera, using natural lighting.","A high-resolution photograph of a slim, fair-skinned woman with long brown hair, standing indoors near a window. She wears a tight, pastel-striped dress that accentuates her curves. The room has light-colored walls and wooden floors. The image uses natural lighting, with a likely DSLR camera, likely settings: f/2.8, 1/60s, ISO 400. Composition follows the rule of thirds.","A high-resolution photograph of a young woman with long, straight brown hair, wearing a pastel-striped, sleeveless ribbed dress. She stands in front of a window, holding a smartphone, obscuring her face. The room has light-colored walls and wooden flooring. The image uses natural lighting, likely taken with a DSLR camera. The composition follows the rule of thirds, with the woman centered.","This is a high-resolution photograph taken with a DSLR camera, likely using a low aperture (f/2.8) and a moderate shutter speed (1/60s) with ISO 400. The image captures a young Asian woman with long, straight brown hair, standing in a well-lit room with natural light streaming through a window. She is holding a smartphone, obscuring her face, and is dressed in a tight, sleeveless, ribbed mini dress featuring horizontal stripes in pastel shades of blue, pink, and purple. The woman has a slim, curvaceous figure and is posed using the rule of thirds, with her left hand resting on her hip. The background includes a white door and light-colored wallpaper with a subtle pattern. The room has wooden flooring.","A young woman with long, light brown hair takes a mirror selfie in a brightly lit, modern bedroom. She wears a white, short-sleeved blouse with a black bow tie, and a black, pleated mini-skirt. She has on black thigh-high stockings with garters. Her skin is fair. The background features a white door, a wooden floor, and a partially visible floral-patterned wallpaper. The photo is likely taken with a smartphone, using natural light.","A high-resolution photograph of a slender, young woman with light skin and long brown hair, wearing a white blouse, black skirt, and thigh-high stockings. She's taking a selfie in a brightly lit room with white curtains and wooden floor. The image uses natural lighting. Likely shot with a DSLR camera, possibly a Canon EOS 5D Mark IV."]},{"id":18,"type":"Simple String","pos":[2460,380],"size":[315,58],"flags":{},"order":0,"mode":0,"inputs":[],"outputs":[{"name":"STRING","type":"STRING","links":[13],"shape":3,"label":"字符串"}],"properties":{"Node name for S&R":"Simple String"},"widgets_values":["XGgirl, supersexy_body"]},{"id":19,"type":"LayerUtility: ImageTaggerSave","pos":[2440,680],"size":[390,410],"flags":{},"order":10,"mode":0,"inputs":[{"name":"image","type":"IMAGE","link":17,"label":"image"},{"name":"tag_text","type":"STRING","link":16,"widget":{"name":"tag_text"},"label":"tag_text"}],"outputs":[],"properties":{"Node name for S&R":"LayerUtility: ImageTaggerSave"},"widgets_values":["","D:\\111","pic","None","jpg",100,true],"color":"rgba(38, 73, 116, 0.7)"},{"id":6,"type":"PreviewBridge","pos":[1575,685],"size":[350,370],"flags":{},"order":5,"mode":0,"inputs":[{"name":"images","type":"IMAGE","link":3,"label":"图像"}],"outputs":[{"name":"IMAGE","type":"IMAGE","links":[5,20],"slot_index":0,"shape":3,"label":"图像"},{"name":"MASK","type":"MASK","links":null,"shape":3,"label":"遮罩"}],"properties":{"Node name for S&R":"PreviewBridge"},"widgets_values":["$6-0",false,"never"]},{"id":22,"type":"Joy_caption_two_load","pos":[2033.5115966796875,127.26544189453125],"size":[315,58],"flags":{},"order":1,"mode":0,"inputs":[],"outputs":[{"name":"JoyTwoPipeline","type":"JoyTwoPipeline","links":[22],"label":"JoyCaptionTwo"}],"properties":{"Node name for S&R":"Joy_caption_two_load"},"widgets_values":["John6666/Llama-3.1-8B-Lexi-Uncensored-V2-nf4"]},{"id":21,"type":"Joy_caption_two_advanced","pos":[2029.322021484375,253.97117614746094],"size":[315,242],"flags":{},"order":7,"mode":0,"inputs":[{"name":"joy_two_pipeline","type":"JoyTwoPipeline","link":22,"label":"JoyCaptionTwo"},{"name":"image","type":"IMAGE","link":20,"label":"图像"},{"name":"extra_options","type":"Extra_Options","link":23,"label":"附加选项"}],"outputs":[{"name":"STRING","type":"STRING","links":[21],"label":"提示词","slot_index":0}],"properties":{"Node name for S&R":"Joy_caption_two_advanced"},"widgets_values":["Descriptive","long","Jane","",false,0.9,0.6]},{"id":23,"type":"Joy_extra_options","pos":[845.9432373046875,158.77537536621094],"size":[696.164306640625,442],"flags":{},"order":2,"mode":0,"inputs":[],"outputs":[{"name":"Extra_Options","type":"Extra_Options","links":[23],"label":"附加选项"}],"properties":{"Node name for S&R":"Joy_extra_options"},"widgets_values":[false,false,true,true,false,false,true,false,true,false,true,true,false,true,true,false,true]},{"id":3,"type":"DF_Image_scale_to_side","pos":[1591.8646240234375,501.2017517089844],"size":[315,130],"flags":{},"order":4,"mode":0,"inputs":[{"name":"image","type":"IMAGE","link":1,"label":"image"}],"outputs":[{"name":"IMAGE","type":"IMAGE","links":[3,17],"slot_index":0,"shape":3,"label":"IMAGE"}],"properties":{"Node name for S&R":"DF_Image_scale_to_side"},"widgets_values":[1920,"Longest","lanczos","disabled"]},{"id":2,"type":"LoadImageListFromDir //Inspire","pos":[1590.5338134765625,248.9171142578125],"size":[315,170],"flags":{},"order":3,"mode":0,"inputs":[],"outputs":[{"name":"IMAGE","type":"IMAGE","links":[1],"slot_index":0,"shape":6,"label":"图像"},{"name":"MASK","type":"MASK","links":null,"shape":6,"label":"遮罩"},{"name":"FILE PATH","type":"STRING","links":null,"shape":6}],"properties":{"Node name for S&R":"LoadImageListFromDir //Inspire"},"widgets_values":["D:\\333",0,0,true]}],"links":[[1,2,0,3,0,"IMAGE"],[3,3,0,6,0,"IMAGE"],[5,6,0,8,0,"IMAGE"],[13,18,0,15,0,"STRING"],[14,11,0,15,1,"STRING"],[16,15,0,19,1,"STRING"],[17,3,0,19,0,"IMAGE"],[20,6,0,21,1,"IMAGE"],[21,21,0,11,0,"STRING"],[22,22,0,21,0,"JoyTwoPipeline"],[23,23,0,21,2,"Extra_Options"]],"groups":[],"config":{},"extra":{"ds":{"scale":0.6588450000000009,"offset":[-616.2324803761892,181.9269546854405]},"workspace_info":{"id":"Cb1wtDeKZ5KO7A0tXIKNS","saveLock":false,"cloudID":null,"coverMediaPath":null},"ue_links":[]},"version":0.4}